================================================================================
Empty manuscript with newline
================================================================================


--------------------------------------------------------------------------------

(source_file)


================================================================================
Empty manuscript with space
================================================================================

--------------------------------------------------------------------------------

(source_file)


================================================================================
Empty manuscript with nothing
================================================================================

--------------------------------------------------------------------------------

(source_file)


================================================================================
Manuscript with title
================================================================================

# Title

Lorem ipsum.


--------------------------------------------------------------------------------

(source_file
  title: (text)
  (paragraph
    (text)))


================================================================================
Manuscript with title and meta
================================================================================

# Title {
  :label: mylbl
}

--------------------------------------------------------------------------------

(source_file
  title: (text)
  meta: (blockmeta
    (pair
      (metakey_text (label))
      (metaval_text))))


================================================================================
Section
================================================================================

:section:

  Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    (paragraph
      (text))))


================================================================================
Section with title
================================================================================

:section: {
  :title: Section title
}

  Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text)))
    (paragraph
      (text))))


================================================================================
Section with meta
================================================================================

:section: {
  :title: Section title
  :class: {t1, t2}
}

  Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text))
      (pair
        (metakey_list (class))
        (metaval_list
          (metaval_list_item)
          (metaval_list_item))))
    (paragraph
      (text))))


================================================================================
Author and abstract
================================================================================

# Test {
  :label: mylbl
}

:author: {
  :name: Leo Torres
  :affiliation: Max Planck Institute for Mathematics in the Sciences
  :email: leo@leotrs.com
}
::

:abstract: {
  :keywords: {spectral graph theory, non-backtracking, interlacing}
  :msc: {05C50, 05C82, 15A18, 15B99}
}

  Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem
  ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem
  ipsum. Lorem ipsum.

  Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem ipsum. Lorem
  ipsum. Lorem ipsum.

::


--------------------------------------------------------------------------------

(source_file
  title: (text)
  meta: (blockmeta
    (pair
      (metakey_text (label))
      (metaval_text)))
  (block
    tag: (author)
    meta: (blockmeta
      (pair
        (metakey_text (name))
        (metaval_text))
      (pair
        (metakey_text (affiliation))
        (metaval_text))
      (pair
        (metakey_text (email))
        (metaval_text))))
  (block
    tag: (abstract)
    meta: (blockmeta
      (pair
        (metakey_list (keywords))
        (metaval_list
          (metaval_list_item)
          (metaval_list_item)
          (metaval_list_item)))
      (pair
        (metakey_list (msc))
        (metaval_list
          (metaval_list_item)
          (metaval_list_item)
          (metaval_list_item)
          (metaval_list_item))))
    (paragraph
      (text)
      (text)
      (text))
    (paragraph
      (text)
      (text))))


================================================================================
Inline meta no space
================================================================================

Foo :claim: {:label:lbl} bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
          (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space before
================================================================================

Foo :claim: { :label:lbl} bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space after
================================================================================

Foo :claim: {:label:lbl } bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space between
================================================================================

Foo :claim: {:label: lbl} bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta space all
================================================================================

Foo :claim: { :label: lbl } bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta no space after tag
================================================================================

Foo :claim:{:label: lbl} bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline meta no space after meta
================================================================================

Foo :claim: {:label: lbl}bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
   (metakey_text (label))
          (metaval_text)))
      (text))
    (text)))


================================================================================
Inline math no shortcut
================================================================================

:math:X::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (math)
      (asis_text))
    (text)))


================================================================================
Inline code no shortcut
================================================================================

:code:X::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (code)
      (asis_text))
    (text)))


================================================================================
Block code no shortcut
================================================================================

:codeblock:
  comp = [abs(x) for x in range(10)]
::


--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (codeblock)
    (asis_text)))


================================================================================
Block code no shortcut and meta
================================================================================

:codeblock: {
  :label: some-code
  :class: python
}

  comp = [abs(x) for x in range(10)]

::


--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (codeblock)
    meta: (blockmeta
      (pair
        (metakey_text (label))
   (metaval_text))
      (pair
        (metakey_list (class))
        (metaval_list
          (metaval_list_item))))
    (asis_text)))


================================================================================
Math inside claim
================================================================================

:claim: :math:2+2=4:: ::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Math inside claim no space
================================================================================

:claim::math:2+2=4::::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Claim with meta and math
================================================================================

:claim: {:label: lbl} all $X$ are $Y$::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      meta: (inlinemeta
        (pair
          (metakey_text (label))
          (metaval_text)))
      (text)
      (specialinline
        tag: (math)
        (asis_text))
      (text)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Enumerate
================================================================================

:enumerate:

  :-: Foo.

  :-: Bar.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        (text)))
    (paragraph
      (item
        (text)))))


================================================================================
Enumerate no space before Halmos
================================================================================

:enumerate:

  :-: Foo.::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        (text)))))


================================================================================
Enumerate items with label
================================================================================

:enumerate:

  :-: {:label: one} Foo.

  :-: {:label: two} Bar.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))))


================================================================================
Itemize
================================================================================

:itemize:

  :-: Foo.

  :-: Bar.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (itemize)
    (paragraph
      (item
        (text)))
    (paragraph
      (item
        (text)))))


================================================================================
Itemize no space before Halmos
================================================================================

:itemize:

  :-: Foo.::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (itemize)
    (paragraph
      (item
        (text)))))


================================================================================
Itemize items with label
================================================================================

:itemize:

  :-: {:label: one} Foo.

  :-: {:label: two} Bar.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (itemize)
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (text)))))

================================================================================
Proof with no steps
================================================================================

:proof:

  By some axiom.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (paragraph
      (text))))


================================================================================
Proof with one step
================================================================================

:proof:

  :step: Axiom. ::

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (text)))))



================================================================================
Proof with three steps
================================================================================

:theorem:

  Socrates is mortal.

::

:proof:

  :step: All men are mortal. ::

  :step: Socrates is a man. ::

  :step: QED ::

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (theorem)
    (paragraph
      (text)))
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (text)))
    (block
      tag: (step)
      (paragraph
        (text)))
    (block
      tag: (step)
      (paragraph
        (text)))))


================================================================================
Proof with sub-step and sub-proof
================================================================================

:proof:

  :step: Top level step.

    :step: Sub-step.

      :p: Sub-proof.::

    ::
  ::

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (text))
      (block
        tag: (step)
        (paragraph
          (text))
        (block
          tag: (subproof)
          (paragraph
            (text)))))))


================================================================================
Span strong
================================================================================

:span: {:strong:}shortcut::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (strong))))
      (text))
    (text)))


================================================================================
Span emphas
================================================================================

:span: {:emphas:}shortcut::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (emphas))))
      (text))
    (text)))


================================================================================
Span strong and emphas
================================================================================

:span: {:strong:, :emphas:}shortcut::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (strong)))
        (pair
          (metakey_bool (emphas))))
      (text))
    (text)))


================================================================================
Strong half word
================================================================================

Bo :span:{:strong:}ld::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_bool (strong))))
      (text))
    (text)))


================================================================================
Reference
================================================================================

## Foo
{
  :label: lbl
}

Bar.

:ref:lbl::.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text))
      (text))))


================================================================================
Reference with space
================================================================================

## Foo
{
  :label: lbl
}

Bar.

:ref: lbl ::.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text))
      (text))))


================================================================================
Reference with reftext
================================================================================

## Foo
{
  :label: lbl
}

Bar.

:ref:lbl,the section::.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text)
        reftext: (text))
      (text))))


================================================================================
Reference with reftext with space
================================================================================

## Foo
{
  :label: lbl
}

Bar.

:ref: lbl , the section ::.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text)))
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text)
        reftext: (text))
      (text))))


================================================================================
External reference with file path
================================================================================

## Foo

Bar.

:ref:definitions/def.rsm#test-label::.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text))
      (text))))


================================================================================
External reference with reftext
================================================================================

## Foo

Bar.

:ref:theorems/thm.rsm#my-theorem,the theorem::.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text)
        reftext: (text))
      (text))))


================================================================================
External reference with relative path
================================================================================

## Foo

Bar.

:ref:../definitions/def.rsm#label::.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (paragraph
      (text))
    (paragraph
      (specialinline
        tag: (ref)
        target: (text))
      (text))))


================================================================================
Escaped colon
================================================================================

Foo\: bar.


--------------------------------------------------------------------------------

(source_file

  (paragraph
    (text)))


================================================================================
Escaped colon inside span
================================================================================

:span: Foo\: bar::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (inline
      tag: (span)
      (text))
    (text)))


================================================================================
ERROR: unclosed strong region
================================================================================

Bo*ld.


--------------------------------------------------------------------------------

(source_file
  (ERROR
    (text)
    (spanemphas)
    (text)))


================================================================================
Escaped star
================================================================================

Bo\*ld.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))


================================================================================
Figure
================================================================================

:figure:

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (figure)))


================================================================================
Figure with meta and caption
================================================================================

:figure: {
  :path: assets/example.png
}

  :caption: This is the figure caption.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (figure)
    meta: (blockmeta
      (pair
        (metakey_any (path))
        (metaval_any)))
    (paragraph
      (caption
        (text)))))


================================================================================
Video
================================================================================

:video: {
  :path: assets/demo.mp4
}

  :caption: This is a video demonstration.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (video)
    meta: (blockmeta
      (pair
        (metakey_any (path))
        (metaval_any)))
    (paragraph
      (caption
        (text)))))


================================================================================
HTML Asset
================================================================================

:html: {
  :path: assets/chart.html
}

  :caption: Interactive visualization.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (html)
    meta: (blockmeta
      (pair
        (metakey_any (path))
        (metaval_any)))
    (paragraph
      (caption
        (text)))))


================================================================================
ERROR: item in the wrong place
================================================================================

## Some section

Lorem ipsum :-: Foo bar.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (paragraph
      (text)
      (ERROR)
      (text))))


================================================================================
List meta pair inside inline meta region
================================================================================

Foo :span: {:class: {t1, t2}} bar :: baz.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (inline
      tag: (span)
      meta: (inlinemeta
        (pair
          (metakey_list (class))
          (metaval_list
            (metaval_list_item)
            (metaval_list_item))))
      (text))
    (text)))


================================================================================
Cite
================================================================================

:cite:foo::


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (cite)
      targetlabels: (text))))


================================================================================
Cite with multiple targets
================================================================================

:cite:foo,bar::


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (cite)
      targetlabels: (text))))


================================================================================
Claimshort within item with meta
================================================================================

:enumerate:

  :-: {:label: one} :⊢: $2+2=4$::.

  :-: {:label: two} :⊢: $3+3=6$::.

::


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (enumerate)
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (construct
          tag: (claim)
          (specialinline
            tag: (math)
            (asis_text)))
        (text)))
    (paragraph
      (item
        meta: (inlinemeta
          (pair
            (metakey_text (label))
            (metaval_text)))
        (construct
          tag: (claim)
          (specialinline
            tag: (math)
            (asis_text)))
        (text)))))


================================================================================
Appendix
================================================================================

## Foo

:appendix:

## Bar


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text))
  (appendix)
  (section
    title: (text)))


================================================================================
Table of Contents
================================================================================

:toc: ::


--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (toc)))


================================================================================
Space after closing mathblock should be allowed
================================================================================

There is a single space after the closing double dollar sign, which makes the following
paragraph freak out on the first letter for some reason.

$$
2+2
$$

x


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (text))
  (mathblock
    (asis_text))
  (paragraph
    (text)))


================================================================================
Mathblock with isclaim meta
================================================================================

$$
{
:isclaim:
}
  2+2 = 4
$$

:mathblock: {
:isclaim:
}
  2+2 = 4
::


--------------------------------------------------------------------------------

(source_file
  (mathblock
    meta: (blockmeta
      (pair
        (metakey_bool (isclaim))))
    (asis_text))
  (mathblock
    meta: (blockmeta
      (pair
        (metakey_bool (isclaim))))
    (asis_text)))


================================================================================
Whitespace after block halmos
================================================================================

:theorem:

  Note the trailing whitespace after the Halmos!

::

foo.


--------------------------------------------------------------------------------

(source_file
  (block
    tag: (theorem)
    (paragraph
      (text)))
  (paragraph
    (text)))


================================================================================
QED inside step
================================================================================

:proof:

  :step:
    :qed:
  ::

::



--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (specialconstruct
          tag: (qed))))))


================================================================================
Section with icon
================================================================================

:section: {
  :title: Section title
  :icon: bookmark
}

  Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text))
      (pair
        (metakey_text (icon))
        (metaval_text)))
    (paragraph
      (text))))


================================================================================
Paragraph does not end at mathblock
================================================================================

Foo.
$$
2+2=4,
$$
bar.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (mathblock
      (asis_text))
    (text)))


================================================================================
Section ends when another begins
================================================================================

## Section 1

## Section 2


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text))
  (section
    title: (text)))


================================================================================
Subsection ends when a section begins
================================================================================

## Section 1

### Subsection

## Section 2


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (subsection
      title: (text)))
  (section
    title: (text)))


================================================================================
Manuscript with top level paragraph and section
================================================================================

Lorem ipsum.

:section: {
  :title: section title
}

Lorem ipsum.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text))
  (section
    meta: (blockmeta
      (pair
        (metakey_text (title))
        (metaval_text)))
    (paragraph
      (text))))
================================================================================
Author with new metakeys
================================================================================

# Test

:config: {
  :author-display-first: 2
  :author-display-last: 5
}
::

:author: {
  :name: Leo Torres
  :affiliation: 1
  :author-note: \*
  :orcid: 0000-0001-2345-6789
  :email: leo@leotrs.com
}
::

:author: {
  :name: Jane Smith
  :affiliation: 2
  :orcid: 0000-0002-3456-7890
}
::


--------------------------------------------------------------------------------

(source_file
  title: (text)
  (block
    tag: (config)
    meta: (blockmeta
      (pair (metakey_any (author_display_first)) (metaval_any))
      (pair (metakey_any (author_display_last)) (metaval_any))))
  (block
    tag: (author)
    meta: (blockmeta
      (pair
        (metakey_text (name))
        (metaval_text))
      (pair
        (metakey_text (affiliation))
        (metaval_text))
      (pair
        (metakey_text (author_note))
        (metaval_text))
      (pair
        (metakey_text (orcid))
        (metaval_text))
      (pair
        (metakey_text (email))
        (metaval_text))))
  (block
    tag: (author)
    meta: (blockmeta
      (pair
        (metakey_text (name))
        (metaval_text))
      (pair
        (metakey_text (affiliation))
        (metaval_text))
      (pair
        (metakey_text (orcid))
        (metaval_text)))))


================================================================================
Manuscript with colon in title
================================================================================

# My Title: A Subtitle

Lorem ipsum.


--------------------------------------------------------------------------------

(source_file
  title: (text)
  (paragraph
    (text)))


================================================================================
Construct tag at start of line after paragraph text
================================================================================

:let: $G$ be a simple graph::.  We will prove a fact.
:define: $L(G) := |E(G)|$, where $E(G)$ is the set of edges::.

More text here.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (let)
      (specialinline
        tag: (math)
        (asis_text))
      (text))
    (text)
    (construct
      tag: (define)
      (specialinline
        tag: (math)
        (asis_text))
      (text)
      (specialinline
        tag: (math)
        (asis_text))
      (text))
    (text))
  (paragraph
    (text)))


================================================================================
Paragraph ending at EOF
================================================================================

# Title

Hello.

--------------------------------------------------------------------------------

(source_file
  title: (text)
  (paragraph
    (text)))
================================================================================
Paragraph ending at EOF without newline
================================================================================

foo
--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)))



================================================================================
Proof step with text ending in colon
================================================================================

:proof:
  :step:
    Foo bar $2+2$:
  ::
::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (ERROR
        (text)
        (specialinline
          tag: (math)
          (asis_text))))))

================================================================================
Proof step with text ending in escaped colon
================================================================================

:proof:
  :step:
    Foo bar $2+2$\:
  ::
::

--------------------------------------------------------------------------------

(source_file
  (block
    tag: (proof)
    (block
      tag: (step)
      (paragraph
        (text)
        (specialinline
          tag: (math)
          (asis_text))
        (text)))))
