================================================================================
Inline math with shortcut
================================================================================

$X$.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (math)
      (asis_text))
    (text)))


================================================================================
Inline code with shortcut
================================================================================

`X`.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (code)
      (asis_text))
    (text)))


================================================================================
Code block with shortcut
================================================================================

```
  comp = [abs(x) for x in range(10)]
```


--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (codeblock)
    (asis_text)))


================================================================================
Code block with shortcut and meta
================================================================================

```
{
  :label: some-code
  :types: python
}

  comp = [abs(x) for x in range(10)]

```


--------------------------------------------------------------------------------

(source_file
  (specialblock
    tag: (codeblock)
    meta: (blockmeta
      (pair
	(metakey_text (label))
        (metaval_text))
      (pair
	(metakey_list (types))
        (metaval_list
	  (metaval_list_item))))
    (asis_text)))


================================================================================
Mathblock with shortcut
================================================================================

$$
  \int_a^bu\frac{d^2v}{dx^2}\,dx
  =\left.u\frac{dv}{dx}\right|_a^b
  -\int_a^b\frac{du}{dx}\frac{dv}{dx}\,dx.
$$


--------------------------------------------------------------------------------

(source_file
  (mathblock
    (asis_text)))


================================================================================
Mathblock with shortcut and meta
================================================================================

$$
{
  :label: some-math
  :types: foo
}

  \int_a^bu\frac{d^2v}{dx^2}\,dx
  =\left.u\frac{dv}{dx}\right|_a^b
  -\int_a^b\frac{du}{dx}\frac{dv}{dx}\,dx.

$$


--------------------------------------------------------------------------------

(source_file
  (mathblock
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text))
      (pair
        (metakey_list (types))
        (metaval_list
          (metaval_list_item))))
    (asis_text)))


================================================================================
Math inside claim with shortcut
================================================================================

:claim: $2+2=4$ ::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Math inside claim with shortcut no space
================================================================================

:claim:$2+2=4$::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Section with shortcut
================================================================================

## Title

Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    (paragraph
      (text))))


================================================================================
Section with shortcut and meta
================================================================================

## Title
{
  :label: sec
  :nonum:
}

Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    title: (text)
    meta: (blockmeta
      (pair
        (metakey_text (label))
        (metaval_text))
      (pair
        (metakey_bool (nonum))))
    (paragraph
      (text))))


================================================================================
Subsection with shortcut
================================================================================

:section:

### Title

Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    (subsection
      title: (text)
      (paragraph
        (text)))))


================================================================================
Subsection with shortcut and meta
================================================================================

:section:

### Title
{
  :label: sub
  :nonum:
}

Foo.


--------------------------------------------------------------------------------

(source_file
  (section
    (subsection
      title: (text)
      meta: (blockmeta
        (pair
	  (metakey_text (label))
          (metaval_text))
        (pair
	  (metakey_bool (nonum))))
      (paragraph
        (text)))))


================================================================================
Span strong with shortcut
================================================================================

**shortcut**.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (spanstrong)
      (text))
    (text)))


================================================================================
Span emphas with shortcut
================================================================================

*shortcut*.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (spanemphas)
      (text))
    (text)))


================================================================================
Span strong and emphas with shortcut
================================================================================

** *shortcut* **.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (spanstrong)
      (specialinline
      tag: (spanemphas)
        (text)))
    (text)))


================================================================================
Span emphas and strong with shortcut
================================================================================

* **shortcut** *.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (specialinline
      tag: (spanemphas)
      (specialinline
      tag: (spanstrong)
        (text)))
    (text)))


================================================================================
Strong half word with shortcut
================================================================================

Bo**ld**.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (specialinline
      tag: (spanstrong)
      (text))
    (text)))


================================================================================
Turnstile
================================================================================

Foo :|-: bar::. Baz.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      (text))
    (text)))


================================================================================
Turnstile with math inside
================================================================================

Foo :|-: $2+2=4$::. Baz.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Paragraph starts with turnstile
================================================================================

:|-: A claim::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (text))
    (text)))


================================================================================
Turnstile unicode
================================================================================

Foo :⊢: bar::. Baz.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      (text))
    (text)))


================================================================================
Turnstile unicode with math inside
================================================================================

Foo :⊢: $2+2=4$::. Baz.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (text)
    (construct
      tag: (claim)
      (specialinline
        tag: (math)
        (asis_text)))
    (text)))


================================================================================
Paragraph starts with turnstile unicode
================================================================================

:⊢: A claim::.


--------------------------------------------------------------------------------

(source_file
  (paragraph
    (construct
      tag: (claim)
      (text))
    (text)))
